phenology fix and streamlit
